# Example 3

Using the [charlist] Wildcard

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# [] -> Represents any single character within the brackets -> h[oa]t finds hot and hat, but not hit.
# ^ -> Represents any character not in the brackets -> h[^oa]t finds hit, but not hot and hat.
# - -> Represents any single character within the specified range -> c[a-b]t finds cat and cbt.
# [] is not supported in sqlite3.
query = '''
            SELECT * 
            FROM Customers
            WHERE City LIKE "b%" OR City LIKE "s%" OR City LIKE "p%"
        '''

## Show table

In [4]:
df = pd.read_sql_query(query, con)
df.head()

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,7,Blondel père et fils,Frédérique Citeaux,"24, place Kléber",Strasbourg,67000,France
2,12,Cactus Comidas para llevar,Patricio Simpson,Cerrito 333,Buenos Aires,1010,Argentina
3,14,Chop-suey Chinese,Yang Wang,Hauptstr. 29,Bern,3012,Switzerland
4,15,Comércio Mineiro,Pedro Afonso,"Av. dos Lusíadas, 23",São Paulo,05432-043,Brazil

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    29 non-null     int64
 1   CustomerName  29 non-null     object
 2   ContactName   29 non-null     object
 3   Address       29 non-null     object
 4   City          29 non-null     object
 5   PostalCode    29 non-null     object
 6   Country       29 non-null     object
dtypes: int64(1), object(6)
memory usage: 1.7+ KB

## Close the connection

In [6]:
con.close()